{
  "article": [
    {
      "id": "1",
      "title": "Understanding Different Types of Ships",
      "category": "Ship Type",
      "img": "https://images.unsplash.com/photo-1506744038136-46273834b3fb?auto=format&fit=crop&w=800&q=80",
      "date": "2025-06-21",
      "body": "Marine engineers classify ships based on their function and design, ranging from cargo carriers to passenger vessels. Each ship type serves a specific purpose, requiring tailored engineering solutions to optimize performance and safety. Understanding the variety of ships is fundamental for professionals in the maritime industry.\n\nCargo ships are the backbone of global trade, designed to carry goods in bulk or containers across oceans. Tankers transport liquids like oil and chemicals, and their design must address safety and environmental concerns. Passenger ships, including ferries and cruise liners, prioritize comfort and amenities alongside safety features.\n\nAdvances in shipbuilding technologies have led to hybrid vessels and specialized ships for research and military use. Engineers continue to innovate, balancing efficiency with environmental regulations and operational demands. Knowledge of ship types aids in navigation, maintenance, and maritime logistics planning.",
      "author": "Capt. Michael Fernando",
      "views": 2020,
      "publish": true
    },
    {
      "id": "2",
      "title": "Types of Pumps Used in Ships",
      "category": "Pumps",
      "img": "https://images.unsplash.com/photo-1549924231-f129b911e442?auto=format&fit=crop&w=800&q=80",
      "date": "2025-06-19",
      "body": "Pumps play a critical role in marine engineering by managing fluids across various ship systems. From bilge water removal to ballast control, the efficient functioning of pumps ensures vessel safety and operational effectiveness. Different pump types are selected based on flow rate, pressure, and the nature of the fluid.\n\nCommon pumps on ships include centrifugal pumps, which use rotational energy to move fluids, and positive displacement pumps that transfer fluid by trapping a fixed volume. Gear pumps and screw pumps are often used for viscous liquids, while reciprocating pumps provide high pressure for specialized tasks.\n\nMaintaining pumps involves regular inspection for wear and corrosion, especially due to harsh marine environments. Innovations in pump design improve energy efficiency and reliability, contributing to greener and more cost-effective maritime operations.",
      "author": "Eng. Dineth Perera",
      "views": 1500,
      "publish": true
    },
    {
      "id": "3",
      "title": "The Science Behind Ship Stability",
      "category": "Ship Stability",
      "img": "https://images.unsplash.com/photo-1469474968028-56623f02e42e?auto=format&fit=crop&w=800&q=80",
      "date": "2025-06-16",
      "body": "Ship stability is essential for preventing capsizing and ensuring safe navigation in varying sea conditions. It involves the ship’s ability to return to an upright position after being tilted by waves, wind, or loading conditions. Marine engineers apply principles of buoyancy, center of gravity, and metacentric height to assess stability.\n\nDesigning a stable ship requires careful calculation of weight distribution and hull form. Stability can be dynamic, affected by changing cargo or ballast, necessitating real-time monitoring and adjustments during voyages. Safety regulations demand rigorous testing and certification to validate stability standards.\n\nTechnological advancements, including computer modeling and sensor integration, aid engineers in predicting and maintaining optimal stability. This enhances the safety of crew, cargo, and the environment by minimizing risks associated with unstable vessels.",
      "author": "Prof. Tharaka Silva",
      "views": 2000,
      "publish": true
    },
    {
      "id": "4",
      "title": "Modern Ship Construction Techniques",
      "category": "Ship Constructions",
      "img": "https://cdn.sanity.io/images/hpm9cfz0/production/3484fc81233e83a7603841ed58c920a80b33c021-1792x1024.webp?w=1792&q=100&auto=format",
      "date": "2025-06-14",
      "body": "Ship construction has evolved significantly with advances in materials and fabrication methods. Modern techniques emphasize modular construction, which allows different sections of a ship to be built simultaneously and later assembled. This approach reduces build time and enhances quality control.\n\nThe use of high-strength steel and corrosion-resistant alloys improves the durability and lifespan of vessels. Welding technology advancements have replaced traditional riveting, providing stronger and more watertight joints. Automation and robotics also play an increasing role in shipyards, improving precision and worker safety.\n\nEnvironmental considerations drive innovation in ship design and construction. Engineers focus on reducing emissions and fuel consumption through hull optimization and alternative propulsion systems. Compliance with international standards ensures new ships meet stringent safety and ecological requirements.",
      "author": "Eng. Thisara Rajapaksa",
      "views": 1800,
      "publish": true
    },
    {
      "id": "5",
      "title": "Emerging Trends in Marine Engineering",
      "category": "Other",
      "img": "https://images.unsplash.com/photo-1500534623283-312aade485b7?auto=format&fit=crop&w=800&q=80",
      "date": "2025-06-12",
      "body": "Marine engineering is rapidly evolving with the integration of digital technologies and sustainable practices. Smart sensors, artificial intelligence, and big data analytics are transforming vessel monitoring, predictive maintenance, and navigation safety. These innovations increase efficiency and reduce operational costs.\n\nRenewable energy sources and eco-friendly fuels are gaining traction to comply with stricter environmental regulations. Hybrid propulsion systems and energy recovery technologies help minimize the carbon footprint of ships. Engineers are also exploring wave and tidal energy conversion for onboard power generation.\n\nCollaboration across industry stakeholders is vital to address challenges such as cybersecurity and regulatory compliance. Training programs are evolving to equip marine engineers with skills to manage complex digital systems and promote innovation in sustainable maritime operations.",
      "author": "Dr. Minoli Jayawardena",
      "views": 1250,
      "publish": true
    }
  ],
  "news": [
    {
      "id": "1",
      "title": "Marine Engineering Conference 2025 Announced",
      "img": "https://images.unsplash.com/photo-1497493292307-31c376b6e479?auto=format&fit=crop&w=800&q=80",
      "date": "2025-06-22",
      "body": "The global marine engineering community is preparing for a major conference in Singapore focused on innovation and sustainability in shipbuilding and oceanography. Experts and industry leaders will share insights on the latest technologies and regulatory frameworks.\n\nWorkshops will cover topics such as green propulsion systems, autonomous vessels, and marine environmental protection. The event aims to foster collaboration between academia, industry, and policymakers to advance maritime technology.\n\nDelegates will also have opportunities for networking, exhibitions of cutting-edge marine equipment, and discussions on career development in marine engineering fields. This conference is a significant milestone in promoting sustainable maritime growth worldwide.",
      "author": "Lahiru Perera",
      "views": 1650,
      "publish": true
    },
    {
      "id": "2",
      "title": "Sri Lanka Launches New Naval Design Program",
      "img": "https://images.unsplash.com/photo-1519985176271-adb1088fa94c?auto=format&fit=crop&w=800&q=80",
      "date": "2025-06-24",
      "body": "The Ministry of Marine Affairs of Sri Lanka has introduced a cutting-edge naval design program aimed at fostering innovation among young engineers. The initiative includes training in advanced naval architecture, ship modeling, and simulation software.\n\nThis program aligns with the country’s goals to enhance its shipbuilding capabilities and develop a skilled workforce capable of designing competitive vessels. Partnerships with leading universities and shipyards are part of the strategic plan.\n\nStudents and professionals enrolling in this program will gain hands-on experience with modern technologies and exposure to international maritime standards. The program is expected to boost Sri Lanka’s presence in the global marine engineering sector.",
      "author": "Chamali Ranasinghe",
      "views": 1350,
      "publish": true
    },
    {
      "id": "3",
      "title": "First Hybrid Cargo Ship Docks in Colombo",
      "img": "https://images.unsplash.com/photo-1501594907352-04cda38ebc29?auto=format&fit=crop&w=800&q=80",
      "date": "2025-06-19",
      "body": "In a historic moment, the Port of Colombo welcomed South Asia’s first hybrid-powered cargo ship. This vessel combines traditional fuel engines with electric propulsion to reduce emissions and improve fuel efficiency.\n\nThe ship’s arrival marks a milestone in the region’s efforts to adopt sustainable shipping practices. Officials highlighted the environmental benefits and the potential for future hybrid and electric vessels in commercial fleets.\n\nMarine engineers are closely monitoring the ship’s performance to gather data for future improvements. This event underscores the maritime industry’s commitment to balancing economic growth with ecological responsibility.",
      "author": "Samantha Dias",
      "views": 1250,
      "publish": true
    },
    {
      "id": "4",
      "title": "Marine Engineering Students Win Global Award",
      "img": "https://images.unsplash.com/photo-1503676260728-1c00da094a0b?auto=format&fit=crop&w=800&q=80",
      "date": "2025-06-17",
      "body": "A team of marine engineering students recently won a prestigious global competition for their innovative ballast water treatment system. Their design emphasizes environmental safety and cost-effectiveness, addressing a major challenge in maritime transport.\n\nThe competition featured teams from universities worldwide, showcasing advancements in marine technology and sustainability. The students impressed judges with their practical approach and comprehensive testing.\n\nThis achievement highlights the growing talent in marine engineering education and the importance of nurturing innovation to meet industry challenges. The winning team plans to collaborate with industry partners to further develop their system.",
      "author": "Ruwan Perera",
      "views": 950,
      "publish": true
    },
    {
      "id": "5",
      "title": "New Research Vessel Commissioned",
      "img": "https://upload.wikimedia.org/wikipedia/commons/0/07/INS_Sandhayak_%28J18%29_during_sea_trials.jpg",
      "date": "2025-06-12",
      "body": "A new state-of-the-art research vessel has been commissioned to support deep-sea exploration and marine environmental studies. Equipped with AI-driven sensors and advanced navigation systems, the vessel represents a leap forward in maritime research capabilities.\n\nThe vessel will enable scientists to conduct long-duration missions, collecting critical data on ocean ecosystems, climate change effects, and underwater geology. Collaboration with international research institutions will maximize its scientific output.\n\nMarine engineers designed the ship to be energy-efficient and highly maneuverable, meeting modern standards for safety and sustainability. The launch ceremony emphasized the vessel’s role in advancing knowledge and protecting marine environments.",
      "author": "Isuri de Alwis",
      "views": 2580,
      "publish": true
    }
  ],
  "comment": [
    {
      "id": "1",
      "article_id": "1",
      "date": "2025-05-22 10:30:00",
      "name": "Gihan Mendis",
      "email": "gihanmendis@gmail.com",
      "comment": "Awesome Content!"
    },
    {
      "id": "2",
      "article_id": "1",
      "date": "2025-06-23 10:30:00",
      "name": "Kusal de Silva",
      "email": "kusaldesilva@gmail.com",
      "comment": "Great!"
    },
    {
      "id": "3",
      "article_id": "1",
      "date": "2025-06-24 10:30:00",
      "name": "Ajantha Perera",
      "email": "ajanthaperera@gmail.com",
      "comment": "Nice!"
    },
    {
      "id": "4",
      "article_id": "2",
      "date": "2025-06-25 10:30:00",
      "name": "Nimali Fonseka",
      "email": "nimalifonseka@gmail.com",
      "comment": "Wow!"
    },
    {
      "id": "5",
      "article_id": "2",
      "date": "2025-06-26 10:30:00",
      "name": "Samantha Jayasinghe",
      "email": "samanthaj@gmail.com",
      "comment": "Very informative post."
    },
    {
      "id": "6",
      "article_id": "3",
      "date": "2025-06-26 10:30:00",
      "name": "Ruwan Karunaratne",
      "email": "ruwank@gmail.com",
      "comment": "Helpful content, thank you!"
    },
    {
      "id": "7",
      "article_id": "3",
      "date": "2025-06-27 10:30:00",
      "name": "Tharushi Madushanka",
      "email": "tharushim@gmail.com",
      "comment": "Really enjoyed this article!"
    },
    {
      "id": "8",
      "article_id": "3",
      "date": "2025-06-27 10:30:00",
      "name": "Dulaj Perera",
      "email": "dulajp@gmail.com",
      "comment": "Good work, keep it up."
    },
    {
      "id": "9",
      "article_id": "4",
      "date": "2025-06-28 10:30:00",
      "name": "Manjula Fernando",
      "email": "manjulafernando@gmail.com",
      "comment": "Excellent insights!"
    },
    {
      "id": "10",
      "article_id": "4",
      "date": "2025-06-28 10:30:00",
      "name": "Harsha Gunasekara",
      "email": "harshagunasekara@gmail.com",
      "comment": "Well written and very clear."
    }
  ]
}